# **Îç∞Ïù¥ÌÑ∞ Îã§Î£®Í∏∞ Î≥µÏäµ**

## 0.ÌôòÍ≤ΩÏ§ÄÎπÑ + Îç∞Ïù¥ÌÑ∞ Î°úÎìú

* ÎùºÏù¥Î∏åÎü¨Î¶¨ Î∂àÎü¨Ïò§Í∏∞

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

* Îç∞Ïù¥ÌÑ∞ Í∞ÄÏ†∏Ïò§Í∏∞

In [5]:
sales = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/sales.csv")
products = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/products.csv")
#products.drop('CategoryOrd', axis =1, inplace = True)
customers = pd.read_csv("https://raw.githubusercontent.com/DA4BAM/dataset/master/customers2.csv")

In [7]:
sales.head()

   OrderID  Seq   OrderDate ProductID  Qty   Amt CustomerID
0      107    2  2016-01-02  p1036481    2  2100    c150417
1       69    1  2016-01-02  p1152861    1  1091    c212716
2       69    7  2016-01-02  p1013161    1  2600    c212716
3       69    8  2016-01-02  p1005771    1  1650    c212716
4       69   11  2016-01-02  p1089531    1  2600    c212716

In [9]:
products.head()

  ProductID ProductName Category SubCategory
0  p1052661         ÏÉàÏö∞Íπ°       Í∞ÑÏãù          Í≥ºÏûê
1  p1054261       Í≥†Íµ¨ÎßàÏä§Ìã±       Í∞ÑÏãù          Í≥ºÏûê
2  p1097821          Ïß±Íµ¨       Í∞ÑÏãù          Í≥ºÏûê
3  p1097831         Í∞êÏûêÏπ©       Í∞ÑÏãù          Í≥ºÏûê
4  p1119071        ÎøåÏÖîÎøåÏÖî       Í∞ÑÏãù          Í≥ºÏûê

In [11]:
customers.head()

  CustomerID RegisterDate Gender  BirthYear
0    c328222   2014-09-25      F       1960
1    c281448   2013-06-18      F       1974
2    c038336   2003-10-10      F       1968
3    c084237   2007-03-09      F       1982
4    c162600   2010-06-14      F       1978

## 1.Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑ Ï°∞Í±¥ Ï°∞ÌöåÌïòÍ∏∞ : .loc

In [ ]:
# 1. Íµ¨Îß§Ïï°(Amt)Ïù¥ 10000Ïõê Ïù¥ÏÉÅÏù∏ ÌåêÎß§Ï†ïÎ≥¥Î•º Ï°∞ÌöåÌïòÏãúÏò§.
# sales.loc[Ìñâ Ï°∞Í±¥  , Ïó¥ Ïù¥Î¶Ñ]
# sales.loc[Ìñâ Ï°∞Í±¥]

In [ ]:
# 2. 2016ÎÖÑ 2Ïõî ÌåêÎß§ Ï†ïÎ≥¥Î•º Ï°∞ÌöåÌïòÏãúÏò§.
# Ï°∞Í±¥ ÎëêÍ∞ú Ïù¥ÏÉÅ Ïó∞Í≤∞ &(and), |(or), Ï£ºÏùòÏÇ¨Ìï≠ : Ï°∞Í±¥ Í∞ÅÍ∞ÅÏùÑ ()Î°ú Î¨∂Ïñ¥ÏïºÌïúÎã§.

In [21]:
# ü§î3. 2Î≤à Î¨∏Ï†úÎ•º .between()ÏùÑ ÏÇ¨Ïö©Ìï¥ÏÑú Ï°∞ÌöåÌï¥Î≥¥ÏÑ∏Ïöî.
#sales.loc[sales['OrderDate'].between('2016-02-01','2016-02-29')]
sales.loc[sales['OrderDate'].between('2016-02-01','2016-03-01',inclusive='left')]

      OrderID  Seq   OrderDate ProductID  Qty    Amt CustomerID
4499      241    8  2016-02-01  p1012811    2   5000    c206248
4500      241    9  2016-02-01  p1012751    2   2700    c206248
4501      241   11  2016-02-01  p1144371    5  14250    c206248
4502      241   12  2016-02-01  p1179241    1   1500    c206248
4503      241   13  2016-02-01  p1013161    4  12000    c206248
...       ...  ...         ...       ...  ...    ...        ...
8851       25   11  2016-02-29  p1191881    1   1750    c146132
8852       25   12  2016-02-29  p1207281    1   2600    c146132
8853       25   14  2016-02-29  p1005621    1   2900    c146132
8854       25   19  2016-02-29  p1012751    1   1500    c146132
8855       27    1  2016-02-29  p1005621    1   2030    c146132

[4357 rows x 7 columns]

In [17]:
sales['OrderDate']

0        2016-01-02
1        2016-01-02
2        2016-01-02
3        2016-01-02
4        2016-01-02
            ...
70007    2017-03-31
70008    2017-03-31
70009    2017-03-31
70010    2017-03-31
70011    2017-03-31
Name: OrderDate, Length: 70012, dtype: object

* .between() : https://pandas.pydata.org/docs/reference/api/pandas.Series.between.html

In [ ]:
# 4. ÏÉÅÌíàÎì§ Ï§ëÏóêÏÑú ÌïòÏúÑ Ïπ¥ÌÖåÍ≥†Î¶¨(SubCategory)Í∞Ä ÏÇ¨ÌÉïÎ•ò, Í≥ºÏûê, Îπµ Ïù∏ ÏÉÅÌíàÏùÑ Ï°∞ÌöåÌïòÏãúÏò§. (.isin ÏÇ¨Ïö©)

* .isin() : https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.isin.html

## 2.ÎÇ†Ïßú Îç∞Ïù¥ÌÑ∞ Îã§Î£®Í∏∞

In [ ]:
# 1. SalesÏùò ÎÇ†Ïßú Îç∞Ïù¥ÌÑ∞Î•º ÎÇ†Ïßú ÌòïÏãùÏúºÎ°ú Î≥ÄÌôòÌïòÏãúÏò§.
# pd.to_datetime(date, format = '%d/%m/%Y') # format = '%d/%m/%Y' ÏûÖÎ†•ÎêòÎäî ÎÇ†ÏßúÍ∞Ä Ïù¥Îü∞ ÌòïÌÉúÏïº~~ ÎùºÍ≥† ÏïåÎ†§Ï£ºÎäî ÏòµÏÖò
# ÎÇ†Ïßú ÌÉÄÏûÖÏúºÎ°ú Î≥ÄÌôòÌïòÎ©¥, ÎÇ†Ïßú ÏöîÏÜåÎ•º Ï∂îÏ∂ú Ìï† Ïàò ÏûàÎã§.

* .to_datetime : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html
* format : https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [ ]:
# 2. sales Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê Ïó∞ÎèÑ Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.
# ÎÇ†ÏßúÌòïÏãùÏùò Î≥ÄÏàò.dt.  <==ÎÇ†Ïßú ÏöîÏÜåÍ∞Ä ÌåùÏóÖÏúºÎ°ú...

In [ ]:
# 3. sales Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê Ïõî Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.

In [ ]:
# 4. customers Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏùò RegisterDateÎ•º ÎÇ†ÏßúÌÉÄÏûÖÏúºÎ°ú Î≥ÄÌôòÌïòÏãúÏò§.

In [ ]:
# 5. customers Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê Îã§Ïùå Îëê Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.
# Îì±Î°ùÏó∞ÎèÑ RegisterYear
# Îì±Î°ùÍ∏∞Í∞Ñ(Îì±Î°ùÏó∞ÎèÑÎ∂ÄÌÑ∞ ÌòÑÏû¨ÍπåÏßÄÏùò ÎÖÑ Ïàò)

In [ ]:
# 6. customers Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóê ÎÇòÏù¥Î•º Í≥ÑÏÇ∞Ìï¥ÏÑú Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.

In [ ]:
# 7. customers Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏóêÏÑú ÎÇòÏù¥Î°ú Î∂ÄÌÑ∞ Ïó∞Î†πÎåÄÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§. pd.cut
# Ïà´ÏûêÌòï Î≥ÄÏàòÎ•º Î≤îÏ£ºÎ°ú Î≥ÄÌôòÌï¥Ï£ºÍ∏∞.

pd.cut ÏÑ§Î™Ö (https://pandas.pydata.org/docs/reference/api/pandas.cut.html)

## 3.ÏßëÍ≥Ñ : value_counts(), groupby()

* value_counts() : https://pandas.pydata.org/docs/reference/api/pandas.Series.value_counts.html
* groupby() : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

In [ ]:
# 1.Category Î≥Ñ ÏÉÅÌíà ÏàòÎ•º Ï°∞ÌöåÌïòÏãúÏò§.(.value_counts())

In [ ]:
# 2. Ï∂úÏÉù Ïó∞ÎèÑÎ≥Ñ ÌöåÏõêÏàò(.value_counts())

In [ ]:
# 3. 2016ÎÖÑ ÏõîÎ≥Ñ, Îß§Ï∂úÏï°Í≥º Ï¥ù ÌåêÎß§ÏàòÎüâ(sum)ÏùÑ Ï°∞Ìöå. (.groupby)

## 4.Í≤∞Ìï© ‚ë† : Ï°∞Ïù∏ join(merge)

* ÌåêÎã§Ïä§ÏóêÏÑú joinÏùÄ ÍµâÏû•Ìûà Í∞ÑÎã®Ìï©ÎãàÎã§.
* ÏûêÎèôÏúºÎ°ú keyÎ•º Ïû°ÏïÑÏ§çÎãàÎã§
* defaultÎ°ú inner joinÏùÑ Ìï©ÎãàÎã§.

In [31]:
# ü§î1. salesÏôÄ productsÎ•º productid Í∏∞Ï§ÄÏúºÎ°ú mergeÌïòÏó¨ ÏÉàÎ°úÏö¥ Îç∞Ïù¥ÌÑ∞ÌîÑÎ†àÏûÑÏúºÎ°ú Ï†ÄÏû•Ìï©ÎãàÎã§.
temp1=pd.merge(sales,products)

In [33]:
# ü§î2. Category Î≥Ñ Ï¥ù Îß§Ï∂úÏï°(Amt)
temp1.groupby('Category', as_index = False)['Amt'].sum()

  Category       Amt
0       Í∞ÑÏãù  12920570
1       Í≥ºÏùº  49789339
2      Î∞òÏ∞¨Î•ò  32204820
3      Ïú†Ï†úÌíà  45261956
4       Ï±ÑÏÜå  54822783

In [35]:
# ü§î3. Category Î≥Ñ Ï¥ù ÌåêÎß§Îüâ(qty)
temp1.groupby('Category', as_index = False)['Qty'].sum()

  Category    Qty
0       Í∞ÑÏãù  12130
1       Í≥ºÏùº   6786
2      Î∞òÏ∞¨Î•ò  20210
3      Ïú†Ï†úÌíà  19731
4       Ï±ÑÏÜå  27859

In [37]:
# ü§î4. Ï†ÑÏ≤¥ÏóêÏÑú Í∞ÄÏû• Îß§Ï∂úÏù¥ ÎÜíÏùÄ ÏÉÅÌíàÎ™Ö 10Í∞ú Ï°∞Ìöå
temp2 = temp1.groupby('ProductName', as_index = False)['Amt'].sum()
temp2.sort_values('Amt', ascending = False).head(10)

   ProductName       Amt
37      Ïö∞Ïú†1000  18129067
23        ÏÇ¨Í≥º_ÏÜå  14078818
9         Îî∏Í∏∞_ÎåÄ  11011541
7         ÎëêÎ∂Ä_ÎåÄ  10119037
10        Îî∏Í∏∞_ÏÜå   7517664
8         ÎëêÎ∂Ä_ÏÜå   7319963
49         ÏΩ©ÎÇòÎ¨º   6971347
39       Ïú†Í∏∞ÎÜçÏö∞Ïú†   6437323
50         ÌÜ†ÎßàÌÜ†   6291001
43          Ï∞∏Ïô∏   5491030

* Ï†ïÎ†¨ : .sort_values : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html

## 5.Í≤∞Ìï© ‚ë° : Î∂ôÏù¥Í∏∞  concat()

In [39]:
# ü§î1. ÏúÑ Ïã§Ïäµ 4-2,3Î≤àÏùò Í≤∞Í≥ºÎ•º Í∞ÅÍ∞Å dataframeÏúºÎ°ú Ï†ÄÏû•ÌïòÏãúÏò§.
temp3=temp1.groupby('Category', as_index = False)['Amt'].sum()
temp4=temp1.groupby('Category', as_index = False)['Qty'].sum()

* ÏòÜÏúºÎ°ú Î∂ôÏù¥Í∏∞ concat(,  axis = 1)

* https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html

In [55]:
temp3.head()

  Category       Amt
0       Í∞ÑÏãù  12920570
1       Í≥ºÏùº  49789339
2      Î∞òÏ∞¨Î•ò  32204820
3      Ïú†Ï†úÌíà  45261956
4       Ï±ÑÏÜå  54822783

In [57]:
temp4.head()

  Category    Qty
0       Í∞ÑÏãù  12130
1       Í≥ºÏùº   6786
2      Î∞òÏ∞¨Î•ò  20210
3      Ïú†Ï†úÌíà  19731
4       Ï±ÑÏÜå  27859

In [73]:
# ü§î2. ÏòÜÏúºÎ°ú Î∂ôÏù¥Í∏∞ concat(, axis = 1)
pd.concat([temp3,temp4],axis=1)

  Category       Amt Category    Qty
0       Í∞ÑÏãù  12920570       Í∞ÑÏãù  12130
1       Í≥ºÏùº  49789339       Í≥ºÏùº   6786
2      Î∞òÏ∞¨Î•ò  32204820      Î∞òÏ∞¨Î•ò  20210
3      Ïú†Ï†úÌíà  45261956      Ïú†Ï†úÌíà  19731
4       Ï±ÑÏÜå  54822783       Ï±ÑÏÜå  27859

In [77]:
# ü§î3. 2016ÎÖÑ 1Ïõî ÌåêÎß§Îç∞Ïù¥ÌÑ∞Î•º Ï†ÄÏû•ÌïòÏãúÏò§.
temp5 = sales.loc[sales['OrderDate'].between('2016-01-01', '2016-02-01', inclusive = 'left')]

# 2017ÎÖÑ 1Ïõî ÌåêÎß§Îç∞Ïù¥ÌÑ∞Î•º Ï†ÄÏû•ÌïòÏãúÏò§.
temp6 = sales.loc[sales['OrderDate'].between('2017-01-01', '2017-02-01', inclusive = 'left')]

# ÎßåÎì†Í≤É Ïó¥Ïñ¥ Î≥¥Í∏∞
display(temp5.head(3))
display(temp6.head(3))
display(temp5.tail(3))
display(temp6.tail(3))

   OrderID  Seq   OrderDate ProductID  Qty   Amt CustomerID
0      107    2  2016-01-02  p1036481    2  2100    c150417
1       69    1  2016-01-02  p1152861    1  1091    c212716
2       69    7  2016-01-02  p1013161    1  2600    c212716

       OrderID  Seq   OrderDate ProductID  Qty   Amt CustomerID
55976        5    2  2017-01-02  p1133371    7  7000    c271068
55977        5    6  2017-01-02  p1012751    1  1850    c271068
55978        5   10  2017-01-02  p1144661    1  1950    c271068

      OrderID  Seq   OrderDate ProductID  Qty   Amt CustomerID
4496      137    6  2016-01-31  p1001771    1  3300    c305733
4497      141    2  2016-01-31  p1072601    1  4150    c328823
4498      141    5  2016-01-31  p1201601    1  2870    c328823

       OrderID  Seq   OrderDate ProductID  Qty   Amt CustomerID
60651      105   26  2017-01-31  p1100371    5  1600    c217725
60652      107    1  2017-01-31  p1207281    1  3300    c234291
60653      107    2  2017-01-31  p1100371    1   400    c234291

## 6.ÏãúÍ≥ÑÏó¥ Îç∞Ïù¥ÌÑ∞ Îã§Î£®Í∏∞
rollingÏùÄ Ï£ºÎ°ú ÏãúÍ≥ÑÏó¥ Îç∞Ïù¥ÌÑ∞Ïóê ÎåÄÌï¥ÏÑú Ïù¥ÎèôÌèâÍ∑†Í∞íÏùÑ Íµ¨ÌïòÍ±∞ÎÇò, ÌñâÏùÑ shift(Ïù¥Îèô) ÏãúÌÇ¨ Îïå Ï£ºÎ°ú ÏÇ¨Ïö©Ìï©ÎãàÎã§.
> ÏãúÍ≥ÑÏó¥ Îç∞Ïù¥ÌÑ∞ : ÌñâÍ≥º ÌñâÏóê ÏãúÍ∞ÑÏàúÏÑúÍ∞Ä ÏûàÎäî Îç∞Ïù¥ÌÑ∞(Ï†ÑÏ†ú : ÏãúÍ∞ÑÏàúÏúºÎ°ú Ï†ïÎ†¨ ÎêòÏñ¥ ÏûàÎäî ÏÉÅÌÉú)

* .shift() : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shift.html
* .rolling : https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.rolling.html

In [79]:
!pip install pykrx

Collecting pykrx
  Downloading pykrx-1.0.48-py3-none-any.whl.metadata (60 kB)
     ---------------------------------------- 0.0/60.9 kB ? eta -:--:--
     ------------ ------------------------- 20.5/60.9 kB 640.0 kB/s eta 0:00:01
     -------------------------------------- 60.9/60.9 kB 804.5 kB/s eta 0:00:00
Requirement already satisfied: requests in c:\users\user\anaconda3\lib\site-packages (from pykrx) (2.32.2)
Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (from pykrx) (2.2.2)
Collecting datetime (from pykrx)
  Downloading DateTime-5.5-py3-none-any.whl.metadata (33 kB)
Requirement already satisfied: numpy in c:\users\user\anaconda3\lib\site-packages (from pykrx) (1.26.4)
Collecting xlrd (from pykrx)
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Collecting deprecated (from pykrx)
  Downloading Deprecated-1.2.14-py2.py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: multipledispatch in c:\users\user\anaconda3\lib\site-packages (from pykrx) (0.6.0)
Requirement already satisfied: matplotlib in c:\users\user\anaconda3\lib\site-packages (from pykrx) (3.8.4)
Requirement already satisfied: zope.interface in c:\users\user\anaconda3\lib\site-packages (from datetime->pykrx) (5.4.0)
Requirement already satisfied: pytz in c:\users\user\anaconda3\lib\site-packages (from datetime->pykrx) (2024.1)
Requirement already satisfied: wrapt<2,>=1.10 in c:\users\user\anaconda3\lib\site-packages (from deprecated->pykrx) (1.14.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (23.2)
Requirement already satisfied: pillow>=8 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (10.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\user\anaconda3\lib\site-packages (from matplotlib->pykrx) (2.9.0.post0)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from multipledispatch->pykrx) (1.16.0)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas->pykrx) (2023.3)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\user\anaconda3\lib\site-packages (from requests->pykrx) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\user\anaconda3\lib\site-packages (from requests->pykrx) (3.7)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\user\anaconda3\lib\site-packages (from requests->pykrx) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\user\anaconda3\lib\site-packages (from requests->pykrx) (2024.7.4)
Requirement already satisfied: setuptools in c:\users\user\anaconda3\lib\site-packages (from zope.interface->datetime->pykrx) (69.5.1)
Downloading pykrx-1.0.48-py3-none-any.whl (2.2 MB)
   ---------------------------------------- 0.0/2.2 MB ? eta -:--:--
   ----- ---------------------------------- 0.3/2.2 MB 8.3 MB/s eta 0:00:01
   ------- -------------------------------- 0.4/2.2 MB 6.5 MB/s eta 0:00:01
   ------------- -------------------------- 0.7/2.2 MB 5.2 MB/s eta 0:00:01
   --------------------- ------------------ 1.2/2.2 MB 5.7 MB/s eta 0:00:01
   ------------------------------- -------- 1.7/2.2 MB 7.2 MB/s eta 0:00:01
   ---------------------------------------  2.2/2.2 MB 7.7 MB/s eta 0:00:01
   ---------------------------------------- 2.2/2.2 MB 6.9 MB/s eta 0:00:00
Downloading DateTime-5.5-py3-none-any.whl (52 kB)
   ---------------------------------------- 0.0/52.6 kB ? eta -:--:--
   ---------------------------------------- 52.6/52.6 kB 2.8 MB/s eta 0:00:00
Downloading Deprecated-1.2.14-py2.py3-none-any.whl (9.6 kB)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
   ---------------------------------------- 0.0/96.5 kB ? eta -:--:--
   ---------------------------------------- 96.5/96.5 kB ? eta 0:00:00
Installing collected packages: xlrd, deprecated, datetime, pykrx
Successfully installed datetime-5.5 deprecated-1.2.14 pykrx-1.0.48 xlrd-2.0.1

In [80]:
from pykrx import stock
import datetime

# Ïò§Îäò ÎÇ†Ïßú Í∞ÄÏ†∏Ïò§Í∏∞
today = datetime.datetime.now()

# 1ÎÖÑ Ï†Ñ ÎÇ†Ïßú Í≥ÑÏÇ∞
one_year_ago = today - datetime.timedelta(days=365)

# Ï£ºÍ∞Ä Îç∞Ïù¥ÌÑ∞ Îã§Ïö¥Î°úÎìú Î∞è Í∞ÑÎã®Ìïú Ï≤òÎ¶¨
stock = stock.get_market_ohlcv_by_date(one_year_ago.strftime('%Y%m%d'), today.strftime('%Y%m%d'), "030200")
stock.reset_index(inplace = True)
stock = stock[['ÎÇ†Ïßú', 'Ï¢ÖÍ∞Ä', 'Í±∞ÎûòÎüâ']]
stock.columns = ['Date', 'Close', 'Volume']
stock.head()

        Date  Close   Volume
0 2023-09-12  30800   926182
1 2023-09-13  31250  1272677
2 2023-09-14  32000  1049773
3 2023-09-15  32850  1117873
4 2023-09-18  32350   658295

In [105]:
# ü§î1. Ï†ÑÎÇ†, Ï†ÑÏ†ÑÎÇ† Ï£ºÍ∞Ä Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§. (.shift)
stock['temp1']=stock['Close'].shift(1)
stock['temp2']=stock['Close'].shift(2)
temp1.head()

0        NaN
1    30800.0
2    31250.0
3    32000.0
4    32850.0
Name: Close, dtype: float64

In [107]:
# ü§î2. Ï†ÑÏ†ÑÎÇ† ÎåÄÎπÑ Ï†ÑÎÇ† Ï£ºÍ∞Ä Ï¶ùÍ∞ê Î≥ÄÏàò Ï∂îÍ∞Ä (.diff)
stock['Close_diff']=stock['temp1'].diff()
stock.head()

        Date  Close   Volume    temp1    temp2  Close_diff
0 2023-09-12  30800   926182      NaN      NaN         NaN
1 2023-09-13  31250  1272677  30800.0      NaN         NaN
2 2023-09-14  32000  1049773  31250.0  30800.0       450.0
3 2023-09-15  32850  1117873  32000.0  31250.0       750.0
4 2023-09-18  32350   658295  32850.0  32000.0       850.0

In [111]:
# ü§î3. 2Î≤à Î≥ÄÏàòÍ∞Ä + Ïù¥Î©¥ 1, ÏïÑÎãàÎ©¥ 0 (np.where)
import numpy as np
stock['Diff']=np.where(stock['Close_diff']>0,1,0)
stock.head()

        Date  Close   Volume    temp1    temp2  Close_diff  Diff
0 2023-09-12  30800   926182      NaN      NaN         NaN     0
1 2023-09-13  31250  1272677  30800.0      NaN         NaN     0
2 2023-09-14  32000  1049773  31250.0  30800.0       450.0     1
3 2023-09-15  32850  1117873  32000.0  31250.0       750.0     1
4 2023-09-18  32350   658295  32850.0  32000.0       850.0     1

In [113]:
# ü§î4. 3Ïùº Ïù¥ÎèôÌèâÍ∑† Ï£ºÍ∞Ä Î≥ÄÏàòÎ•º Ï∂îÍ∞ÄÌïòÏãúÏò§.(rolling().mean())
stock['Close1']=stock['Close'].rolling(3,min_periods=1).mean()
stock.head()

        Date  Close   Volume    temp1    temp2  Close_diff  Diff        Close1
0 2023-09-12  30800   926182      NaN      NaN         NaN     0  30800.000000
1 2023-09-13  31250  1272677  30800.0      NaN         NaN     0  31025.000000
2 2023-09-14  32000  1049773  31250.0  30800.0       450.0     1  31350.000000
3 2023-09-15  32850  1117873  32000.0  31250.0       750.0     1  32033.333333
4 2023-09-18  32350   658295  32850.0  32000.0       850.0     1  32400.000000